In [1]:
from pyhive import hive
import pymysql
conn = hive.Connection(host='127.0.0.1', port=10000, username='root')
cursor = conn.cursor()

In [ ]:
def exec_sql(sql):
    cursor.execute(sql)
    for result in cursor.fetchall():
        print(result)

# 2018贺岁档

In [ ]:
t_romance_sql = '''SELECT '2018he','t_romance',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_romance=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_romance_sql)
del t_romance_sql

In [ ]:
t_comedy_sql = '''SELECT '2018he','t_comedy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_comedy=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_comedy_sql)
del t_comedy_sql

In [ ]:
t_animate_sql = '''SELECT '2018he','t_animate',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_animate=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_animate_sql)
del t_animate_sql

In [ ]:
t_plot_sql = '''SELECT '2018he','t_plot',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_plot=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_plot_sql)
del t_plot_sql

In [ ]:
t_horror_sql = '''ELECT '2018he','t_horror',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_horror=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_horror_sql)
del t_horror_sql

In [ ]:
t_thriller_sql = '''SELECT '2018he','t_thriller',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_thriller=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_thriller_sql)
del t_thriller_sql

In [ ]:
t_science_sql = '''SELECT '2018he','t_science',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_science=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_science_sql)
del t_science_sql

In [ ]:
t_action_sql = '''SELECT '2018he','t_action',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_action=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_action_sql)
del t_action_sql

In [ ]:
t_suspense_sql = '''SELECT '2018he','t_suspense',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_suspense=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_suspense_sql)
del t_suspense_sql

In [ ]:
t_crime_sql = '''SELECT '2018he','t_crime',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_crime=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_crime_sql)
del t_crime_sql

In [ ]:
t_adventure_sql = '''SELECT '2018he','t_adventure',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_adventure=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_adventure_sql)
del t_adventure_sql

In [ ]:
t_war_sql = '''SELECT '2018he','t_war',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_war=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_war_sql)
del t_war_sql

In [ ]:
t_fantasy_sql = '''SELECT '2018he','t_fantasy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_fantasy=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_fantasy_sql)
del t_fantasy_sql

In [ ]:
t_sports_sql = '''SELECT '2018he','t_sports',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_sports=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_sports_sql)
del t_sports_sql

In [ ]:
t_family_sql ='''SELECT '2018he','t_family',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_family=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_family_sql)
del t_family_sql

In [ ]:
t_costume_sql = '''SELECT '2018he','t_costume',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_costume=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_costume_sql)
del t_costume_sql

In [ ]:
t_sword_sql = '''SELECT '2018he','t_sword',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_sword=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_sword_sql)
del t_sword_sql

In [ ]:
t_cowboy_sql = '''SELECT '2018he','t_cowboy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_cowboy=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_cowboy_sql)
del t_cowboy_sql

In [ ]:
t_history_sql = '''SELECT '2018he','t_history',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_history=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_history_sql)
del t_history_sql

In [ ]:
t_biography_sql ='''SELECT '2018he','t_biography',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_biography=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_biography_sql)
del t_biography_sql

In [ ]:
t_dance_sql = '''SELECT '2018he','t_dance',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_dance=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_dance_sql)
del t_dance_sql

In [ ]:
t_dark_sql = '''SELECT '2018he','t_dark',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_dark=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_dark_sql)
del t_dark_sql

In [ ]:
t_short_sql = '''SELECT '2018he','t_short',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_short=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_short_sql)
del t_short_sql

In [ ]:
t_documentary_sql = '''SELECT '2018he','t_documentary',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_documentary=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_documentary_sql)
del t_documentary_sql

In [ ]:
t_others_sql = '''SELECT '2018he','t_others',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_others=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(t_others_sql)
del t_others_sql

In [ ]:
c_Mainland_sql = '''SELECT '2018he','c_Mainland',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Mainland_sql)
del c_Mainland_sql

In [ ]:
c_America_sql = '''SELECT '2018he','c_America',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_America_sql)
del c_America_sql

In [ ]:
c_Korea_sql = '''SELECT '2018he','c_Korea',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Korea_sql)
del c_Korea_sql

In [ ]:
c_Japan_sql = '''SELECT '2018he','c_Japan',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Japan_sql)
del c_Japan_sql

In [ ]:
c_Hongkong_sql = '''SELECT '2018he','c_Hongkong',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Hongkong_sql)
del c_Hongkong_sql

In [ ]:
c_Taiwan_sql = '''SELECT '2018he','c_Taiwan',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Taiwan_sql)
del c_Taiwan_sql

In [ ]:
c_Thailand_sql = '''SELECT '2018he','c_Thailand',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Thailand_sql)
del c_Thailand_sql

In [ ]:
c_India_sql = '''SELECT '2018he','c_India',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_India_sql)
del c_India_sql

In [ ]:
c_France_sql = '''SELECT '2018he','c_France',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_France_sql)
del c_France_sql

In [ ]:
c_England_sql = '''SELECT '2018he','c_England',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_England_sql)
del c_England_sql

In [ ]:
c_Russia_sql = '''SELECT '2018he','c_Russia',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Russia_sql)
del c_Russia_sql

In [ ]:
c_Italy_sql = '''SELECT '2018he','c_Italy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Italy_sql)
del c_Italy_sql

In [ ]:
c_Spain_sql = '''SELECT '2018he','c_Spain',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Spain_sql)
del c_Spain_sql

In [ ]:
c_Germany_sql = '''SELECT '2018he','c_Germany',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Germany_sql)
del c_Germany_sql

In [ ]:
c_Poland_sql = '''SELECT '2018he','c_Poland',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Poland_sql)
del c_Poland_sql

In [ ]:
c_Australia_sql = '''SELECT '2018he','c_Australia',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Australia_sql)
del c_Australia_sql

In [ ]:
c_Iran_sql = '''SELECT '2018he','c_Iran',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Iran_sql)
del c_Iran_sql

In [ ]:
c_Others_sql = '''SELECT '2018he','c_Others',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate  >='2018-02-15'and mdate  <='2018-02-21') t2'''
exec_sql(c_Others_sql)
del c_Others_sql